# PropertyNotClosed Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OpeningFailures..::..PropertyNotClosed Property
BuiltInFailures..::..OpeningFailures Class See Also
---
Property lines do not form a closed loop. Area will not be computed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PropertyNotClosed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PropertyNotClosed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PropertyNotClosed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..OpeningFailures Class
Autodesk.Revit.DB Namespace